In [1]:
!pip install SQLAlchemy
!pip install psycopg2

Requirement already satisfied: SQLAlchemy in c:\users\leila\anaconda3\lib\site-packages (1.3.20)
Collecting psycopg2
  Downloading psycopg2-2.8.6-cp38-cp38-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6

In [5]:
# import dependencies
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import psycopg2

In [12]:
# engine = create_engine('postgresql://localhost:5432/<EmployeeSQL>')
# connection = engine.connect()

conn = psycopg2.connect("dbname=EmployeeSQL user=postgres password=postgres host=localhost")
cursor = conn.cursor()
cursor

In [10]:
salaries_data = pd.read_sql("SELECT * FROM salaries", conn)
salaries_data

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [13]:
titles_data = pd.read_sql("SELECT * FROM titles", conn)
titles_data

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager